#!usr/bin/python3

def linear():
    print('Общий вид линейного уравнения: ax + b = 0')
    print('Введите значения коэффициентов a и b через пробел')
    a, b = map(str, input().split())
    x = -1.0 * float(b) / float(a)
    print(f'Ответ: x = {x}')
    print('_______________________________________________________________________________________')

def quadratic():
    print('Общий вид квадратного уравнения: ax^2 + bx + c = 0')
    print('Введите значения коэффициентов a, b и c через пробел')
    a, b, c = map(float, input().split())
    d = b**2 - (4 * a * c)
    if(d < 0): print('Данное уравнение не имеет решений');
    elif(d == 0):
        x = (-1 * b) / (2 * a)
        print(f'Ответ: x = {x}')
    else:
        xo = ((-1 * b)+(d**0.5)) / (2 * a)
        xt = ((-1 * b)-(d**0.5)) / (2 * a)
        print(f'Ответ: x1 = {xo}, x2 = {xt}')
    print('_______________________________________________________________________________________')

def progression():
    MN = '''Выберите один из трех пунктов, введя соответствущий номер
1. Вывести все элементы прогрессии
2. Вывести номер элемента прогрессии, равного определенному значению
3. Вывести значение элемента прогрессии под определенным номером'''
    print('Введите значение первого элемента прогрессии')
    el = int(input())
    print('Введите значение разности между соседними элементами')
    r = input()
    print(MN)
    c = input()
    if c == '2':
        nm = 1
        print('Введите значение элемента прогрессии:')
        n = int(input())
        if n == el: print(nm)
        else:
            while el != n:
                el += int(r)
                nm += 1
            print(f'Элемент со значением {n} находится под номером {nm}')
    elif c == '1':
        print('Введите количество элементов в прогрессии')
        siz = int(input())
        print('Получившая арифметическая прогрессия:')
        print(el, end = ' ')
        for i in range(siz - 1):
            el += int(r)
            print(el, end = ' ')
        print()
    elif c == '3':
        print('Введите номер элемента прогрессии:')
        nb = int(input())
        for i in range(nb - 1):
            el += int(r)
        print(f'Элемент под номером {nb} имеет значение {el}')
    print('_______________________________________________________________________________________')
def dr():
    M = '''1. +
2. -
3. *
4. /'''
    print('Введите числитель и знаменатель первой дроби через пробел')
    x1, y1 = map(int, input().split())
    print('Введите числитель и знаменатель второй дроби через пробел')
    x2, y2 = map(int, input().split())
    print('Введите номер операции, которую вы хотите применить к данным дробям')
    print(M)
    cm = int(input())
    if cm == 1:
        r1 = (x1 * y2) + (x2 * y1)
        r2 = y1 * y2
        NOD = abs(r1)
        if NOD > abs(r2):
            NOD = abs(r2)
        while not (r1 % NOD == 0 and r2 % NOD == 0): NOD -= 1;

        r1 //= NOD
        r2 //= NOD
        print(f'{x1}/{y1} + {x2}/{y2} = {r1}/{r2}')
    elif cm == 2:
        r1 = (x1 * y2) - (x2 * y1)
        r2 = y1 * y2
        NOD = abs(r1)
        if NOD > abs(r2):
            NOD = abs(r2)
        while not (r1 % NOD == 0 and r2 % NOD == 0): NOD -= 1;

        r1 //= NOD
        r2 //= NOD
        print(f'{x1}/{y1} - {x2}/{y2} = {r1}/{r2}')
    elif cm == 3:
        r1 = x1  * x2
        r2 = y1 * y2
        NOD = abs(r1)
        if NOD > abs(r2):
            NOD = abs(r2)
        while not (r1 % NOD == 0 and r2 % NOD == 0): NOD -= 1;

        r1 //= NOD
        r2 //= NOD
        print(f'{x1}/{y1} * {x2}/{y2} = {r1}/{r2}')
    elif cm == 4:
        r1 = x1 * y2
        r2 = y1 * x2
        NOD = abs(r1)
        if NOD > abs(r2):
            NOD = abs(r2)
        while not (r1 % NOD == 0 and r2 % NOD == 0): NOD -= 1;

        r1 //= NOD
        r2 //= NOD
        print(f'{x1}/{y1} / {x2}/{y2} = {r1}/{r2}')
    print('_______________________________________________________________________________________')
